----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [32, 16, 400, 400]             144
       BatchNorm2d-2         [32, 16, 400, 400]              32
             ReLU6-3         [32, 16, 400, 400]               0
         h_sigmoid-4         [32, 16, 400, 400]               0
           h_swish-5         [32, 16, 400, 400]               0
            Conv2d-6         [32, 16, 200, 200]             144
       BatchNorm2d-7         [32, 16, 200, 200]              32
              ReLU-8         [32, 16, 200, 200]               0
 AdaptiveAvgPool2d-9             [32, 16, 1, 1]               0
           Linear-10                    [32, 8]             136
             ReLU-11                    [32, 8]               0
           Linear-12                   [32, 16]             144
            ReLU6-13                   [32, 16]               0
        h_sigmoid-14                   [32, 16]               0
          SELayer-15         [32, 16, 200, 200]               0
           Conv2d-16          [32, 8, 200, 200]             128
      BatchNorm2d-17          [32, 8, 200, 200]              16
 InvertedResidual-18          [32, 8, 200, 200]               0
           Conv2d-19         [32, 40, 200, 200]             320
      BatchNorm2d-20         [32, 40, 200, 200]              80
             ReLU-21         [32, 40, 200, 200]               0
           Conv2d-22         [32, 40, 100, 100]             360
      BatchNorm2d-23         [32, 40, 100, 100]              80
         Identity-24         [32, 40, 100, 100]               0
             ReLU-25         [32, 40, 100, 100]               0
           Conv2d-26          [32, 8, 100, 100]             320
      BatchNorm2d-27          [32, 8, 100, 100]              16
 InvertedResidual-28          [32, 8, 100, 100]               0
           Conv2d-29         [32, 32, 100, 100]             256
      BatchNorm2d-30         [32, 32, 100, 100]              64
             ReLU-31         [32, 32, 100, 100]               0
           Conv2d-32         [32, 32, 100, 100]             288
      BatchNorm2d-33         [32, 32, 100, 100]              64
         Identity-34         [32, 32, 100, 100]               0
             ReLU-35         [32, 32, 100, 100]               0
           Conv2d-36          [32, 8, 100, 100]             256
      BatchNorm2d-37          [32, 8, 100, 100]              16
 InvertedResidual-38          [32, 8, 100, 100]               0
           Conv2d-39         [32, 32, 100, 100]             256
      BatchNorm2d-40         [32, 32, 100, 100]              64
            ReLU6-41         [32, 32, 100, 100]               0
        h_sigmoid-42         [32, 32, 100, 100]               0
          h_swish-43         [32, 32, 100, 100]               0
           Conv2d-44           [32, 32, 50, 50]             800
      BatchNorm2d-45           [32, 32, 50, 50]              64
AdaptiveAvgPool2d-46             [32, 32, 1, 1]               0
           Linear-47                    [32, 8]             264
             ReLU-48                    [32, 8]               0
           Linear-49                   [32, 32]             288
            ReLU6-50                   [32, 32]               0
        h_sigmoid-51                   [32, 32]               0
          SELayer-52           [32, 32, 50, 50]               0
            ReLU6-53           [32, 32, 50, 50]               0
        h_sigmoid-54           [32, 32, 50, 50]               0
          h_swish-55           [32, 32, 50, 50]               0
           Conv2d-56           [32, 16, 50, 50]             512
      BatchNorm2d-57           [32, 16, 50, 50]              32
 InvertedResidual-58           [32, 16, 50, 50]               0
           Conv2d-59           [32, 96, 50, 50]           1,536
      BatchNorm2d-60           [32, 96, 50, 50]             192
            ReLU6-61           [32, 96, 50, 50]               0
        h_sigmoid-62           [32, 96, 50, 50]               0
          h_swish-63           [32, 96, 50, 50]               0
           Conv2d-64           [32, 96, 50, 50]           2,400
      BatchNorm2d-65           [32, 96, 50, 50]             192
AdaptiveAvgPool2d-66             [32, 96, 1, 1]               0
           Linear-67                   [32, 24]           2,328
             ReLU-68                   [32, 24]               0
           Linear-69                   [32, 96]           2,400
            ReLU6-70                   [32, 96]               0
        h_sigmoid-71                   [32, 96]               0
          SELayer-72           [32, 96, 50, 50]               0
            ReLU6-73           [32, 96, 50, 50]               0
        h_sigmoid-74           [32, 96, 50, 50]               0
          h_swish-75           [32, 96, 50, 50]               0
           Conv2d-76           [32, 16, 50, 50]           1,536
      BatchNorm2d-77           [32, 16, 50, 50]              32
 InvertedResidual-78           [32, 16, 50, 50]               0
           Conv2d-79           [32, 96, 50, 50]           1,536
      BatchNorm2d-80           [32, 96, 50, 50]             192
            ReLU6-81           [32, 96, 50, 50]               0
        h_sigmoid-82           [32, 96, 50, 50]               0
          h_swish-83           [32, 96, 50, 50]               0
           Conv2d-84           [32, 96, 50, 50]           2,400
      BatchNorm2d-85           [32, 96, 50, 50]             192
AdaptiveAvgPool2d-86             [32, 96, 1, 1]               0
           Linear-87                   [32, 24]           2,328
             ReLU-88                   [32, 24]               0
           Linear-89                   [32, 96]           2,400
            ReLU6-90                   [32, 96]               0
        h_sigmoid-91                   [32, 96]               0
          SELayer-92           [32, 96, 50, 50]               0
            ReLU6-93           [32, 96, 50, 50]               0
        h_sigmoid-94           [32, 96, 50, 50]               0
          h_swish-95           [32, 96, 50, 50]               0
           Conv2d-96           [32, 32, 50, 50]           3,072
      BatchNorm2d-97           [32, 32, 50, 50]              64
 InvertedResidual-98           [32, 32, 50, 50]               0
           Conv2d-99           [32, 96, 50, 50]           3,072
     BatchNorm2d-100           [32, 96, 50, 50]             192
           ReLU6-101           [32, 96, 50, 50]               0
       h_sigmoid-102           [32, 96, 50, 50]               0
         h_swish-103           [32, 96, 50, 50]               0
          Conv2d-104           [32, 96, 50, 50]           2,400
     BatchNorm2d-105           [32, 96, 50, 50]             192
AdaptiveAvgPool2d-106             [32, 96, 1, 1]               0
          Linear-107                   [32, 24]           2,328
            ReLU-108                   [32, 24]               0
          Linear-109                   [32, 96]           2,400
           ReLU6-110                   [32, 96]               0
       h_sigmoid-111                   [32, 96]               0
         SELayer-112           [32, 96, 50, 50]               0
           ReLU6-113           [32, 96, 50, 50]               0
       h_sigmoid-114           [32, 96, 50, 50]               0
         h_swish-115           [32, 96, 50, 50]               0
          Conv2d-116           [32, 32, 50, 50]           3,072
     BatchNorm2d-117           [32, 32, 50, 50]              64
InvertedResidual-118           [32, 32, 50, 50]               0
          Conv2d-119           [32, 96, 50, 50]           3,072
     BatchNorm2d-120           [32, 96, 50, 50]             192
           ReLU6-121           [32, 96, 50, 50]               0
       h_sigmoid-122           [32, 96, 50, 50]               0
         h_swish-123           [32, 96, 50, 50]               0
AdaptiveAvgPool2d-124             [32, 96, 1, 1]               0
          Linear-125                 [32, 1024]          99,328
           ReLU6-126                 [32, 1024]               0
       h_sigmoid-127                 [32, 1024]               0
         h_swish-128                 [32, 1024]               0
         Dropout-129                 [32, 1024]               0
          Linear-130                    [32, 7]           7,175
     MobileNetV3-131                    [32, 7]               0
================================================================
Total params: 151,463
Trainable params: 151,463
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 78.12
Forward/backward pass size (MB): 9122.74
Params size (MB): 0.58
Estimated Total Size (MB): 9201.45
----------------------------------------------------------------
